[
    {
        "reviewer": {
            "comment": "Best college if you want to pursue  diploma.Staff and teachers are just excellent with professional teaching skills", 
            "displayName": "kenil ruparelia"
        }
    },
    {
        "reviewer": {
            "comment": "Best collage...it's new building is create one of the best atmosphere for study...and it's staff is also too goo....specifically of civil departments staff.", 
            "displayName": "Drawing Guru"
        
        }
    },
   
    {
        "reviewer": {
            "comment": "The college just got a new building,fully air conditioned but the crowd is still very very bad and i am not even exaggerating.The teaching quality is poor.Hardly any good teachers.The students studying here are least interested in engineering and only study for name sake.They make alot of noise during class and donot let the teacher teach.If tou have even 1% genuine interest in engineering,never ever ckme to this college.", 
        "displayName": "Manas Yewale"
        }
    },
    {
        "reviewer": {
            "comment": "Awesome", 
        "displayName": "Karan Negandhi"
            
        }
    },
    {
        "reviewer": {
            "comment": "😘😘", 
        "displayName": "Payal Shah"
        }
    },{
        "reviewer": {
            "comment": "One of the Oldest diploma college in Mumbai", 
        "displayName": "Nikunj Waghasiya"
        }
    },{
        "reviewer": {
            "comment": "Best college for diploma", 
        "displayName": "Shaikh Mazin"
        }
    },
    {
        "reviewer": {
            "comment": "This college infrastructure is 1st class... It is one of the best college for chemical engineering... Teachers are highly educated.    College provides 6 months implant training in top most companies ... Laboratories are  also  good.", 
        "displayName": "Aniket Kambli"
        }
    },
    {
        "reviewer": {
            "comment": "It is one of the best polytechnic  for diploma", 
        "displayName": "Deep Maru"
        }
    },
    {
        "reviewer": {
            "comment": "Best polytechnic in Mumbai", 
        "displayName": "sameer kasar"
        }
    },
    
    {
        "reviewer": {
         "comment": "Good college but need many improvements\n", 
        "displayName": "tejas lad"

        }
    },
    
    {
        "reviewer": {
                  "comment": "One of the best college in Mumbai for Diploma in mechanical engineering.\nThe staff of mechanical is very good. The lecture are conducted regular. There is inplant training for 12 months (2 semester's).\nThe infrastructure is not that good. The canteen is very bad. There is no lab for every subject .", 
        "displayName": "Ahmed Shah"

        }
    },
    
    {
        "reviewer": {
         
      "comment": "One of the best diploma colleges in town. It has 4 year diploma where students study 3 years in college and 1 year have to get internship in companies ", 
       "displayName": "Daksh Pandya"
     
        }
    },
    {
        "reviewer": {
         
      "comment": "My dream college for engineering", 
       "displayName": "Rahul More"
     
        }
    },
    {
        "reviewer": {
         
      "comment": "Shorter version: Awful methods of teaching. Some professors are good, others are just PITA. Next to no-one cares about learning, everyone is looking for ways to get more marks and for that they will do anything to accomplish it. E.g. writing 50-100 page journals, which includes nothing but copied stuff from books/old journals.\n\nFull:\n75% attendance is compulsory! 90% of the time lectures are pure garbage and still you have to go to college and attend, what an awful waste of time. 90% professors thing we are some kinda empty buckets and they are filling us with their factual knowledge. The thing they don't understand  is not everyone is same. I never needed lectures, I could study on my own with books and internet resources. But nearly 7-8 hours of my day were being wasted behind college, which I could've used to pursuit my other hobbies.\n\nExamination style is wet poop. Final tests include 7*2=14 questions in total. Most of them are just for checking you memory. You gotta remember facts to ace examinations. No one cares about understanding of concepts. Ever heard about job interview where they ask you complicated formulas? They don't! Cause it makes no sense to remember them, when you can easily derive them or use a book/internet in real life. But you gotta remember them at SBMP! \n\nIn-plant training is good. You get to have experience in real industry for ~1 year. But they grade it on the basis of report you make, which they DON'T READ!\n\nI guess, I can't tell if this one is worst, cause I don't have experience with other colleges in India.\n\nMy advise: Stay away from this college, and if you find similar reviews about other colleges, stay away from higher education altogether. It's awful waste of time, YOLO!", 
       "displayName": "Chandni Sharma"
    
        }
    },
    {
        "reviewer": {
         
      "comment": "horrible college. transferred out of first year. teachers keep cancelling lectures. focus on unnessecary  journal writing instead of actual teaching or understanding of concepts. teacher with not much prior knowledge. Would not recommend Thakur gave me a better all-around experience ", 
       "displayName": "Simran Garg"
        }
    },
    {
        "reviewer": {
            "comment": "Excellent Curriculum, I am happy with my career after studying Diploma in Plastics Engineering (Passed in Year 2007)", 
      "displayName": "Hiten Chudasama"
        }
    },
    
    {
        "reviewer": {
         "comment": "4 year diploma ! Awesome college !", "displayName": "Karan Sankhe"
        }
    },
    
    {
        "reviewer": {
            "comment": "Its nice college", 
       "displayName": "Kajal Sawant"
        }
    },
    {
        "reviewer": {
               "comment": "best polytechnic college for diploma students special quota for Gujarati community", 
        "displayName": "Dhiren Gala"

        }
    },

{
        "reviewer": {
               "comment": "Nice collage for diploma\n", 
        "displayName": "Mukaram Gadiwala"

        }
    },

{
        "reviewer": {
               "comment": "Not a good college staff is not co operative", 
        "displayName": "Houdini"
    

        }
    },

{
        "reviewer": {
               "comment": "Awesome cllg .... wid very good staff members . Always ready to help . ", 
        "displayName": "prachi sonawane"

        }
    },

{
        "reviewer": {
               "comment": "A decent college with good HODs and staff is better in teaching except ones who teach for temporary basis. Canteen always remains full during break so seating arrangement can be a issue sometimes, cashier counter is average ,railway concession is excellent .Overall college atmosphere is nice", 
        "displayName": "Viren Joshi"

        }
    },

{
        "reviewer": {
               "comment": "One college that deserves a name in top 10 diploma college in mumbai. ", 
        "displayName": "Abhi"
    

        }
    },
{
        "reviewer": {
              "comment": "I have been to this awesome College !!", 
       "displayName": "Shraddha Shrivas"
     

        }
    },
{
        "reviewer": {     
      "comment": "One of the best diploma college in Mumbai", 
       "displayName": "SHAIKH MOHAMMAD ISMEAZAM"
     

        }
    },

{
        "reviewer": {
      "comment": "best diploma in chemical enggineering", 
       "displayName": "Paras shah"

        }
    },
{
        "reviewer": {
             "comment": "It is one of the best polytechnic for diploma in mumbai. It has one of the best architecture. The whole building is centralised ac and all the furniture is of top quality. The teachers are also very good. They are humble and very good in teaching" 
        "displayName": "manas acharekar"
       
        }
    },
    {
        "reviewer": {
    
      "comment": "Being an alumni of the college I can assure you that the college has the finest faculties having a wide range of experience in each of their subjects. And not to forget the different streams for selection  (Civil Engineering Mechanical Engineering Electrical Engineering Industrial Electronics Plastic Engineering Chemical Engineering Digital Electronics Computer Engineering Information Technology) that this college has.\n\nBeing a pass out from the computer engineering department the faculty is really great. Each of the faculty who is teaching you has an extensive knowledge and experience about the subject. Not only that but the Practical knowledge that you get from here will really help you for your degree as well as higher studies. The faculties are really helpful and are really approachable and friendly anytime you have some doubt.\n\nComing to the Infrastructure the college has only recently been shifted to the new building and the new infrastructure is simply wonderful. The labs are all equipped with the latest in tech desktops and the WiFi facility provided throughout the college is pretty fast and reliable. The labs are well maintained and even the lab assistants and technicians are really helpful.\n\nAll in all this is the best college as far as diploma is concerned with highly experienced and helpful faculties friendly staff and the best infrastructure a college can have. \n\nAnd not to forget a special thanks to all the Computer Engineering department Faculties for being so wonderful." 
        "displayName": "Ronit Gaikwad"
        }
    },
    {
        "reviewer": {
   
      "comment": "Went to ARC centre 5th floor very helpful staff.Awsome place to study.\nLuckily my son got Admission.All students are lucky those who are studying here .\nTwo years back also went to ARC centre but now the college has being Renovated excellent work done by SVKM .\nSo spacious class rooms with comparable  chairs for students.\nWow saw from outside there practical room was also marvelous.\nI am thankful to God my son got admission here.\nPrincipal sir Vice Principal Registrator all were very helpful to solve all my queries.\nThank you." 
        "displayName": "Rosy Kohli"
       
        }
    },
    {
        "reviewer": {
      
      "comment": "this college was demolished and new building is allocated" 
        "displayName": "Digambar Chougale"

        }
    },
    {
        "reviewer": {
      "comment": "One of the best college" 
        "displayName": "Mangesh Gawas"
      

        }
    },
     {
        "reviewer": {
      
      "comment": "This is one of the best college in Mumbai with good faculty and it's infrastructure is the excellent as compared to other diploma college's in Mumbai." 
        "displayName": "Onkar Dere"
       

        }
    },
     {
        "reviewer": {
      
      
      "comment": "Very good college for diplomaand also they upgrading their infrastructure too.\nIntelligent teachersgood staff..." 
        "displayName": "it's prat"
      

        }
    },
     {
        "reviewer": {
      
      "comment": "One of the nice collage for diploma" 
        "displayName": "Kishan Jethava"
       

        }
    },
     {
        "reviewer": {
      
      "comment": "\nBest college in Mumbai for diploma.new building of clg.is fully centralized with air condioner. and the staff of civil Department is very good.All over college is best👍" 
        "displayName": "Abhishek patil"
       
      

        }
    },
     {
        "reviewer": {
      
"comment": "No doubt the education is good over here...teachers are friendly and helpful... Yes the old bldg was damaged and not maintained but Atleast we are now alloted with the new classrooms in the new bldgwhich is fully centralized with air conditioner.Best college in all aspects" 
        "displayName": "Khyati Rawal"

        }
    },
     {
        "reviewer": {
      "comment": "The college provides finest education which is prerequisite to work as an engineer . All those who have commented in regard with infrastructure of the institute must have a visit once to new college building . Also the institute stives for preparing engineers for better future......." 
        "displayName": "Tarak Sawant"
      

        }
    },
     {
        "reviewer": {
      
      "comment": "Best for diploma but it's infrastructure is damaged. New centralized bhagubhai will open shortly." 
        "displayName": "Jainam Shah"
      

        }
    },
     {
        "reviewer": {
      
      "comment": "Good Infrastructure" 
        "displayName": "raajanandh s"
      

        }
    },
     {
        "reviewer": {
      
      "comment": "Specially known for its diploma course after SSC. Now managed by SVKM but still under Mumbai University " 
        "displayName": "Siddhesh Gupte"
      

        }
    },
     {
        "reviewer": {
      
      "comment": "Highly recommended for Chemical Engg Diploma" 
        "displayName": "ARUNKUMAR YADAV"

        }
    },
     {
        "reviewer": {
      

      "comment": "Lovin the infra!! Best faculty and have good time for diploma!!!" 
        "displayName": "Ritik Darji"
       
        }
    },
     {
        "reviewer": {
      
      "comment": "Best Diploma college in Mumbai Excellent Teaching Computer Labs are good Auditorium is great Teaching Staff is really amazing and well educated" 
        "displayName": "Bhavin Vadhiya"
      

        }
    },
    
    
]